// Плотность металлов (кг/м3)
export const DENSITIES: Record<string, number> = {
  "Чёрный": 7850,
  "Нержавейка": 7900,
  "Алюминий": 2700,
  "Медь": 8940,
  "Латунь": 8730,
  "Бронза": 8800,
  "Титан": 4500,
};

// Список ассортимента
export const METAL_DATA: Record<string, string[]> = {
  "Чёрный": ["Арматура", "Балка/двутавр", "Квадрат", "Круг/пруток", "Лента", "Лист/плита", "Труба круглая", "Труба профильная", "Уголок", "Швеллер", "Шестигранник"],
  "Нержавейка": ["Квадрат", "Круг/пруток", "Лента", "Лист/плита", "Отвод", "Труба круглая", "Труба профильная", "Уголок", "Фланец плоский", "Швеллер", "Шестигранник"],
  "Алюминий": ["Квадрат", "Круг/пруток", "Лента", "Лист/плита", "Труба круглая", "Труба профильная", "Уголок", "Шестигранник"],
  "Медь": ["Круг/пруток", "Лента", "Лист/плита", "Труба круглая"],
  "Латунь": ["Круг/пруток", "Лист/плита", "Труба круглая", "Шестигранник", "Проволока"],
  "Бронза": ["Круг/пруток", "Лента", "Лист/плита", "Труба круглая", "Втулка"],
  "Титан": ["Круг/пруток", "Лист/плита", "Труба круглая"],
};

export const METALS = Object.keys(METAL_DATA);

import type { UiSelectOption } from "./ui";

export const BEAM_TYPES: UiSelectOption[] = [
  { label: "ГОСТ 8239-89", value: "GOST_8239_89" },
  { label: "Нормальный двутавр (Б)", value: "B" },
  { label: "Широкополочный двутавр (Ш)", value: "SH" },
  { label: "Колонный двутавр (К)", value: "K" },
  { label: "Двутавр дополнительной серии (Д)", value: "D" },
  { label: "Сварной двутавр (С)", value: "S" },
];

export const BEAM_NUMBERS_BY_TYPE: Record<string, string[]> = {
  GOST_8239_89: [
    "10","12","14","16","18","20","22","24","27","30","33","36","40","45","50","55","60",
  ],

  B: [
    "10Б1",
    "12Б1","12Б2",
    "14Б1","14Б2",
    "16Б1","16Б2",
    "18Б1","18Б2",
    "20Б1",
    "23Б1",
    "26Б1","26Б2",
    "30Б1","30Б2",
    "35Б1","35Б2",
    "40Б1","40Б2",
    "45Б1","45Б2",
    "50Б1","50Б2",
    "55Б1","55Б2",
    "60Б1","60Б2",
    "70Б1","70Б2",
    "80Б1","80Б2",
    "90Б1","90Б2",
    "100Б1","100Б2","100Б3","100Б4",
  ],
  SH: [
    "20Ш1","23Ш1","26Ш1","26Ш2",
    "30Ш1","30Ш2","30Ш3",
    "35Ш1","35Ш2","35Ш3",
    "40Ш1","40Ш2","40Ш3",
    "50Ш1","50Ш2","50Ш3","50Ш4",
    "60Ш1","60Ш2","60Ш3",
    "70Ш1","70Ш2","70Ш3","70Ш4","70Ш5"
  ],

  K: [
    "20К1","20К2",
    "23К1","23К2",
    "26К1","26К2","26К3",
    "30К1","30К2","30К3",
    "35К1","35К2","35К3",
    "40К1","40К2","40К3","40К4","40К5",
  ],

  D: [
    "24ДБ1",
    "27ДБ1",
    "35ДБ1",
    "36ДБ1",
    "40ДБ1",
    "45ДБ1",
    "45ДБ2",
    "30ДШ1",
    "40ДШ1",
    "50ДШ1",
  ],

  S: [
  "45БС1",
  "45БС2",
  "45БС3",

  "50БС1",
  "50БС2",
  "50БС3",
  "50БС4",

  "55БС1",
  "55БС2",

  "60БС1",
  "60БС2",
  "60БС3",
  "60БС4",
  "60БС5",
  "60БС6",

  "70БС1",
  "70БС2",
  "70БС3",
  "70БС4",
  "70БС5",
  "70БС6",

  "80БС1",
  "80БС2",

  "90БС1",
  "90БС2",

  "100БС1",
  "100БС2",
  "100БС3",

  "120БС1",
  "120БС2",

  "140БС1",
  "140БС2",
  "140БС3",

  "160БС1",
  "160БС2",
  "160БС3",
  "160БС4",

  "180БС1",
  "180БС2",
  "180БС3",
  "180БС4",

  "200БС1",
  "200БС2",
  "200БС3",
],

};

export const BEAM_KG_PER_M: Record<string, Record<string, number>> = {
  GOST_8239_89: {
    "10": 9.46,
    "12": 11.50,
    "14": 13.70,
    "16": 15.90,
    "18": 18.40,
    "20": 21.00,
    "22": 24.00,
    "24": 27.30,
    "27": 31.50,
    "30": 36.50,
    "33": 42.20,
    "36": 48.60,
    "40": 57.00,
    "45": 66.50,
    "50": 78.50,
    "55": 92.60,
    "60":108.00,
  },

    B: {
    "10Б1": 8.1,
    "12Б1": 8.7,
    "12Б2": 10.4,
    "14Б1": 10.5,
    "14Б2": 12.9,
    "16Б1": 12.7,
    "16Б2": 15.8,
    "18Б1": 15.4,
    "18Б2": 18.8,
    "20Б1": 22.4,
    "23Б1": 25.8,
    "26Б1": 28.0,
    "26Б2": 31.2,
    "30Б1": 32.9,
    "30Б2": 36.6,
    "35Б1": 38.9,
    "35Б2": 43.3,
    "40Б1": 48.1,
    "40Б2": 54.7,
    "45Б1": 59.8,
    "45Б2": 67.5,
    "50Б1": 73.0,
    "50Б2": 80.7,
    "55Б1": 89.0,
    "55Б2": 97.9,
    "60Б1": 106.2,
    "60Б2": 115.6,
    "70Б1": 129.3,
    "70Б2": 144.2,
    "80Б1": 159.5,
    "80Б2": 177.9,
    "90Б1": 194.0,
    "90Б2": 213.8,
    "100Б1": 230.6,
    "100Б2": 258.2,
    "100Б3": 285.7,
    "100Б4": 314.5,
  },

    SH: {
    "20Ш1": 30.6,   // кг/м
    "23Ш1": 36.2,
    "26Ш1": 42.7,
    "26Ш2": 49.2,
    "30Ш1": 53.6,
    "30Ш2": 61.0,
    "30Ш3": 68.3,
    "35Ш1": 75.1,
    "35Ш2": 82.2,
    "35Ш3": 91.3,
    "40Ш1": 96.1,
    "40Ш2": 111.1,
    "40Ш3": 123.4,
    "50Ш1": 114.4,
    "50Ш2": 138.7,
    "50Ш3": 156.4,
    "50Ш4": 174.1,
    "60Ш1": 142.1,
    "60Ш2": 176.9,
    "60Ш3": 205.5,
    "70Ш1": 169.9,
    "70Ш2": 197.6,
    "70Ш3": 235.4,
    "70Ш4": 268.1,
    "70Ш5": 305.9,
  },

    K: {
    "20К1": 41.5,
    "20К2": 46.9,
    "23К1": 52.2,
    "23К2": 59.5,
    "26К1": 65.2,
    "26К2": 73.2,
    "26К3": 83.1,
    "30К1": 84.8,
    "30К2": 96.3,
    "30К3": 108.9,
    "35К1": 109.7,
    "35К2": 125.9,
    "35К3": 144.5,
    "40К1": 138.0,
    "40К2": 165.6,
    "40К3": 202.3,
    "40К4": 242.2,
    "40К5": 291.2,
  },

    D: {
    "24ДБ1": 27.8,
    "27ДБ1": 31.9,
    "35ДБ1": 33.6,
    "36ДБ1": 49.1,
    "40ДБ1": 39.7,
    "45ДБ1": 52.6,
    "45ДБ2": 65.0,

    // Двутавры доп. серии широкополочные (ДШ)
    "30ДШ1": 72.7,
    "40ДШ1": 124.0,
    "50ДШ1": 155.0,
  },

    S: {
    "45БС1": 64.06,
    "45БС2": 133.8,
    "45БС3": 65.94,

    "50БС1": 85.57,
    "50БС2": 117.8,
    "50БС3": 160.1,
    "50БС4": 190.8,

    "55БС1": 102.6,
    "55БС2": 90.67,

    "60БС1": 111.6,
    "60БС2": 126.7,
    "60БС3": 151.8,
    "60БС4": 185.5,
    "60БС5": 219.2,
    "60БС6": 101.0,

    "70БС1": 142.4,
    "70БС2": 171.4,
    "70БС3": 196.5,
    "70БС4": 231.7,
    "70БС5": 302.2,
    "70БС6": 119.9,

    "80БС1": 162.1,
    "80БС2": 248.0,

    "90БС1": 201.6,
    "90БС2": 276.9,

    "100БС1": 244.3,
    "100БС2": 269.4,
    "100БС3": 329.2,

    "120БС1": 242.4,
    "120БС2": 277.6,

    "140БС1": 257.5,
    "140БС2": 273.2,
    "140БС3": 350.1,

    "160БС1": 292.0,
    "160БС2": 307.7,
    "160БС3": 372.1,
    "160БС4": 395.6,

    "180БС1": 384.7,
    "180БС2": 388.6,
    "180БС3": 427.8,
    "180БС4": 502.4,

    "200БС1": 403.5,
    "200БС2": 480.4,
    "200БС3": 527.5,
  }

};

export const STEEL_GRADES = [
  "Ст 3",
  "10",
  "20",
  "40Х",
  "45",
  "65",
  "65Г",
  "09Г2С",
  "15Х5М",
  "10ХСНД",
  "12Х1МФ",
  "ШХ15",
  "Р6М5",
  "У7",
  "У8",
  "У8А",
  "У10",
  "У10А",
  "У12А",
  "17Г1С",
  "17Г1СУ",
  "Прочее",
] as const;

export const STEEL_GRADE_DENSITY: Record<string, number> = {
  "Ст 3": 7750,
  "10": 7800,
  "20": 7800,
  "40Х": 7770,
  "45": 7770,
  "65": 7760,
  "65Г": 7760,
  "09Г2С": 7750,
  "15Х5М": 7700,
  "10ХСНД": 7750,
  "12Х1МФ": 7750,
  "ШХ15": 7760,
  "Р6М5": 8240,
  "У7": 7780,
  "У8": 7780,
  "У8А": 7780,
  "У10": 7760,
  "У10А": 7760,
  "У12А": 7760,
  "Прочее": 7750,
};

// Масса 1 погонного метра швеллера (П и У)
// ГОСТ 8240-97

export const CHANNEL_KG_PER_M: Record<string, number> = {
  "5П": 4.84,
  "5У": 4.84,

  "6.5П": 5.90,
  "6.5У": 5.90,

  "8П": 7.05,
  "8У": 7.05,

  "10П": 8.59,
  "10У": 8.59,

  "12П": 10.40,
  "12У": 10.40,

  "14П": 12.30,
  "14У": 12.30,

  "16П": 14.20,
  "16У": 14.20,

  "18П": 16.30,
  "18У": 16.30,

  "20П": 18.40,
  "20У": 18.40,

  "22П": 21.00,
  "22У": 21.00,

  "24П": 24.00,
  "24У": 24.00,

  "27П": 27.70,
  "27У": 27.70,

  "30П": 31.80,
  "30У": 31.80,

  "33П": 36.50,
  "33У": 36.50,

  "36П": 41.90,
  "36У": 41.90,

  "40П": 48.30,
  "40У": 48.30,
};

