export const BRONZE_GRADES = [
    "БрБ2",
    "БрАЖ9-4",
    "БрАЖМц10-3-1,5",
    "БрАЖН10-4-4",
    "БрАМц9-2",
    "БрКМц3-1",
    "БрОФ7-0,2",
    "БрОЦС5-5-5",
    "Прочее",
] as const;

export type BronzeGrade = (typeof BRONZE_GRADES)[number];

export const BRONZE_DENSITIES: Record<BronzeGrade, number> = {
    "БрБ2": 8250,
    "БрАЖ9-4": 7800,
    "БрАЖМц10-3-1,5": 7700,
    "БрАЖН10-4-4": 7600,
    "БрАМц9-2": 7800,
    "БрКМц3-1": 8200,
    "БрОФ7-0,2": 8800,
    "БрОЦС5-5-5": 8800,
    "Прочее": 8200,
};

export const BRONZE_DATA = [
    "Круг/пруток",
    "Лента",
    "Лист/плита",
    "Труба круглая",
    "Шестигранник",
];
