export const TITAN_GRADES = [
    "ВТ1-00",
    "ВТ1-1",
    "АТ-6",
    "ВТ14",
    "ВТ20",
    "ВТ22",
    "ВТ3-1",
    "ВТ5",
    "ВТ5-1",
    "ВТ6",
    "ОТ4-1",
    "ПТ7М",
    "Прочее",
] as const;

export type TitanGrade = (typeof TITAN_GRADES)[number];

export const TITAN_DENSITIES: Record<TitanGrade, number> = {
    "ВТ1-00": 4505,
    "ВТ1-1": 4505,
    "АТ-6": 4505,
    "ВТ14": 4520,
    "ВТ20": 4450,
    "ВТ22": 4600,
    "ВТ3-1": 4500,
    "ВТ5": 4400,
    "ВТ5-1": 4425,
    "ВТ6": 4450,
    "ОТ4-1": 4550,
    "ПТ7М": 4490,
    "Прочее": 4500,
};

export const TITAN_DATA = [
    "Круг/пруток",
    "Лист/плита",
    "Труба круглая",
    "Шестигранник",
];
